In [3]:
import pandas as pd
import MySQLdb
import csv

In [4]:
connection = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'mytestdb',
    charset='utf8'
)

In [5]:
connection

In [6]:
cursor = connection.cursor()

In [7]:
sql = '''
drop table if exists mytable ;
'''
cursor.execute(sql)

0

In [8]:
sql = '''
create table mytable
(
email varchar(225),
phone varchar(225),
address varchar(225),
deposit int,
rent int
);'''

In [9]:
cursor.execute(sql)

0

In [10]:
sql = '''
show tables;
'''
cursor.execute(sql)

1

In [11]:
cursor.fetchall()

(('mytable',),)

In [12]:
sql = '''
select * from mytable;
'''
cursor.execute(sql)

0

In [13]:
sql = '''
insert into mytable (email, phone, address, deposit, rent)
values(
'multicampus@gmail.com',
'010-555-5555',
'서울시 강남구 역삼동',
5000,10
);
'''

In [14]:
cursor.execute(sql)

1

In [15]:
sql = '''
select * from mytable;
'''

In [16]:
db = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'sakila',
    charset='utf8'
)

In [17]:
df = pd.read_sql('select * from customer', db)
df.head(5)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [18]:
db = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'employees',
    charset='utf8'
)

In [19]:
df = pd.read_sql('select * from employees', db)
df.head(5)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [20]:
df = pd.read_sql('show tables;', db)
df.head()

  Tables_in_employees
0         departments
1            dept_emp
2        dept_manager
3           employees
4            salaries

In [25]:
def save_to_csv(table_name):
    table_df = pd.read_sql('select * from {};'.format(table_name), db)
    table_df.to_csv('./data/{}.csv'.format(table_name))

In [26]:
df['Tables_in_employees'].apply(save_to_csv)

DatabaseError: Execution failed on sql 'select * from departments;': (1146, "Table 'world.departments' doesn't exist")

In [27]:
db = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'world',
    charset='utf8'
)

In [28]:
sql = '''
select * from city;
'''
city_df = pd.read_sql(sql, db)
city_df.to_csv('./data/world_city.csv')

FileNotFoundError: [Errno 2] No such file or directory: './data/world_city.csv'

In [30]:
sql = '''
select * from country;
'''
country_df = pd.read_sql(sql, db)
country_df.to_csv('./data/world_country.csv')

FileNotFoundError: [Errno 2] No such file or directory: './data/world_country.csv'

In [31]:
# country에서
# name, population, continent 만을 뽑아서 country_df 로 출력
# pandas 와 sql로 각각 실행
# 칼럼명 '국가명', '인구수', '대륙'

In [32]:
db = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'world',
    charset='utf8'
)

In [33]:
sql = '''
select * from city;
'''
cursor.execute(sql)

ProgrammingError: (1146, "Table 'mytestdb.city' doesn't exist")

In [34]:
db

In [35]:
pwd

'C:\\Users\\user\\Desktop\\sql'

In [36]:
country_df = pd.read_csv('./data/country.csv')

FileNotFoundError: [Errno 2] File b'./data/country.csv' does not exist: b'./data/country.csv'

In [37]:
country_df = country_df[['Name', 'Population', 'Continent']]
country_df.head()

          Name  Population      Continent
0        Aruba      103000  North America
1  Afghanistan    22720000           Asia
2       Angola    12878000         Africa
3     Anguilla        8000  North America
4      Albania     3401200         Europe

In [38]:
country_df.columns = ['국가명', '인구수', '대륙']
country_df.head()

           국가명       인구수             대륙
0        Aruba    103000  North America
1  Afghanistan  22720000           Asia
2       Angola  12878000         Africa
3     Anguilla      8000  North America
4      Albania   3401200         Europe

In [39]:
country_df.rename(columns = {'Name':'국가명', 'Population':'인구수', 'Continent':'대륙'}

SyntaxError: unexpected EOF while parsing (<ipython-input-39-be3d0c9ed54f>, line 1)

In [40]:
sql = '''
select name , population , continent from country;
'''
pd.read_sql(sql, db).head()

          name  population      continent
0        Aruba      103000  North America
1  Afghanistan    22720000           Asia
2       Angola    12878000         Africa
3     Anguilla        8000  North America
4      Albania     3401200         Europe

In [41]:
sql = '''
select name '국가명', population '인구수', continent '대륙' from country;
'''
pd.read_sql(sql, db).head()

           국가명       인구수             대륙
0        Aruba    103000  North America
1  Afghanistan  22720000           Asia
2       Angola  12878000         Africa
3     Anguilla      8000  North America
4      Albania   3401200         Europe

In [42]:
country_df.count()

국가명    239
인구수    239
대륙     239
dtype: int64

In [43]:
len(country_df)

239

In [44]:
sql = '''
select count(*) 전체데이터수 from country;'''

pd.read_sql(sql, db)

   전체데이터수
0     239

In [45]:
# europe에 위치하고 인구수가 10,000,000 이상인
#국가명, 위치한 대륙, 인구수를 dataframe 으로 출력
# pandas와 sql을 각각 이용

In [46]:
ep = country_df[country_df['Continent'] == 'Europe'][country_df['Population'] >= 10000000]
ep.head()

KeyError: 'Continent'

In [47]:
eu = country_df['Continent'] == 'Europe'
po = country_df['Population'] >= 10000000
country_df[eu & po].head()

KeyError: 'Continent'

In [48]:
sql = '''
select name, population, continent from country
where continent = 'europe' and population >= 10000000;
'''
pd.read_sql(sql, db).head()

             name  population continent
0         Belgium    10239000    Europe
1         Belarus    10236000    Europe
2  Czech Republic    10278100    Europe
3         Germany    82164700    Europe
4           Spain    39441700    Europe

In [49]:
## asia 또는 europe에 속한 국가명, 인구수, 대륙을 출력

In [50]:
asia = country_df['Continent'] == 'Asia'
europe = country_df['Continent'] == 'Europe'
country_df[asia | europe].head()

KeyError: 'Continent'

In [51]:
country_df[country_df['Continent'].isin(['Asia', 'Europe'])].head()

KeyError: 'Continent'

In [52]:
sql = '''
select name, population, continent from country
where continent in ('europe',  'asia');
'''
pd.read_sql(sql,db).head()

                   name  population continent
0           Afghanistan    22720000      Asia
1               Albania     3401200    Europe
2               Andorra       78000    Europe
3  United Arab Emirates     2441000      Asia
4               Armenia     3520000      Asia

In [53]:
# 인구수 내림차순으로 국가명, 인구수 dataframe으로 출력
# pandas, sql

In [54]:
country_df.sort_values('Population', ascending = False)[['Population', 'Name']].head()

KeyError: 'Population'

In [62]:
sql = '''
select name, population from country
where continent in ('europe',  'asia') order by population desc;
'''
pd.read_sql(sql,db).head()

                 name  population
0               China  1277558000
1               India  1013662000
2           Indonesia   212107000
3            Pakistan   156483000
4  Russian Federation   146934000

In [63]:
# GovernmentForm/country table 에서 republic이라는 텍스트가 포함된 row
# pandas, sql
# 국가명, governmentform

In [64]:
db_country = pd.read_csv('./data/country.csv')

FileNotFoundError: [Errno 2] File b'./data/country.csv' does not exist: b'./data/country.csv'

In [65]:
db_country.head()

NameError: name 'db_country' is not defined

In [66]:
db_re = db_country['GovernmentForm'] == 'republic'
db_re.head()

NameError: name 'db_country' is not defined

In [67]:
db_country.head()

NameError: name 'db_country' is not defined

In [61]:
db_NG = db_country[['Name', 'GovernmentForm']]

NameError: name 'db_country' is not defined

In [51]:
db_NG[db_NG['GovernmentForm'].str.contains('Republic')].head()

NameError: name 'db_NG' is not defined

In [52]:
sql = '''
select name, governmentform from country
where governmentform like '%republic%';
'''
pd.read_sql(sql,db).head()

DatabaseError: Execution failed on sql '
select name, governmentform from country
where governmentform like '%republic%';
': (1146, "Table 'employees.country' doesn't exist")

In [53]:
# sakila
# adress, name - 이름과 주소가 함께 있는 df

In [54]:
df = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'sakila',
    charset='utf8'
)

In [68]:
df_s = pd.read_sql('select * from customer', df)
df_s.head(5)

AttributeError: 'DataFrame' object has no attribute 'cursor'

In [56]:
df_a = pd.read_sql('select * from address', df)
df_a.head()

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4...,2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44...,2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x...,2014-09-25 22:31:53

In [57]:
df_s = df_s[['last_name', 'address_id']]
df_s.head()

  last_name  address_id
0     SMITH           5
1   JOHNSON           6
2  WILLIAMS           7
3     JONES           8
4     BROWN           9

In [58]:
df_a = df_a[['address_id', 'address']]
df_a.head()

   address_id               address
0           1     47 MySakila Drive
1           2    28 MySQL Boulevard
2           3     23 Workhaven Lane
3           4  1411 Lillydale Drive
4           5        1913 Hanoi Way

In [59]:
pd.merge(df_s, df_a, on = 'address_id')[['last_name', 'address']].head()

  last_name            address
0     SMITH     1913 Hanoi Way
1   JOHNSON   1121 Loja Avenue
2  WILLIAMS  692 Joliet Street
3     JONES   1566 Inegl Manor
4     BROWN    53 Idfu Parkway

In [60]:
sql = '''
select * from customer;
'''
df_s = pd.read_sql(sql, df)

In [61]:
sql = '''
select * from address;
'''
df_a = pd.read_sql(sql, df)

In [62]:
sql = '''
select last_name, address from customer c inner join address a on a.address_id = c.address_id;
'''
pd.read_sql(sql,df).head()

  last_name            address
0     SMITH     1913 Hanoi Way
1   JOHNSON   1121 Loja Avenue
2  WILLIAMS  692 Joliet Street
3     JONES   1566 Inegl Manor
4     BROWN    53 Idfu Parkway

In [63]:
# world db => (country name, city name)

In [64]:
df = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'world',
    charset='utf8'
)

In [65]:
df_coun = pd.read_sql('select * from country', df)
df_coun.head(5)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,JosÃ© Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,ShqipÃ«ria,Republic,Rexhep Mejdani,34.0,AL

In [66]:
df_ci = pd.read_sql('select * from city', df)
df_ci.columns = ['ID', 'city_Name', 'Code', 'District', 'Population']
df_ci.head(5)

   ID       city_Name Code       District  Population
0   1           Kabul  AFG          Kabol     1780000
1   2        Qandahar  AFG       Qandahar      237500
2   3           Herat  AFG          Herat      186800
3   4  Mazar-e-Sharif  AFG          Balkh      127800
4   5       Amsterdam  NLD  Noord-Holland      731200

In [67]:
df_counN = df_coun[['Name', 'Code']]
df_counN.head()

          Name Code
0        Aruba  ABW
1  Afghanistan  AFG
2       Angola  AGO
3     Anguilla  AIA
4      Albania  ALB

In [68]:
df_ciN = df_ci[['city_Name', 'Code']]
df_ciN.head()

        city_Name Code
0           Kabul  AFG
1        Qandahar  AFG
2           Herat  AFG
3  Mazar-e-Sharif  AFG
4       Amsterdam  NLD

In [69]:
pd.merge(df_counN, df_ciN, on = 'Code')[['Name', 'city_Name']].head()

          Name       city_Name
0        Aruba      Oranjestad
1  Afghanistan           Kabul
2  Afghanistan        Qandahar
3  Afghanistan           Herat
4  Afghanistan  Mazar-e-Sharif

In [70]:
#pd.merge(df_counN, df_ciN, left_on = 'Code', right_on = 'Code')[['Name_x', 'Name_y']].head()

In [71]:
sql = '''
select co.Name 'Country', ci.name 'city' from country co inner join city ci on co.Code = ci.countryCode;
'''
pd.read_sql(sql,db).head()

DatabaseError: Execution failed on sql '
select co.Name 'Country', ci.name 'city' from country co inner join city ci on co.Code = ci.countryCode;
': (1146, "Table 'employees.country' doesn't exist")

In [ ]:
# sakila의 rental 테이블에서 월별 렌탈 수 출력
# 날짜는 오름차순 정렬
# dataframe
# pandas, sql

In [241]:
df = MySQLdb.connect(
'localhost',
    'root',
    '1234',
    'sakila',
    charset='utf8'
)

In [242]:
sql = '''
select * from rental;
'''
df_r = pd.read_sql(sql, df)
df_r.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [243]:
df_r = pd.read_sql('select * from rental', df)
df_r.head(5)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [244]:
df_r['month'] = df_r['rental_date'].apply(lambda x: str(x)[:7])

In [245]:
df_r['month'].head()

0    2005-05
1    2005-05
2    2005-05
3    2005-05
4    2005-05
Name: month, dtype: object

In [246]:
sr = df_r.groupby('month')['rental_id'].count()
sr[:]

month
2005-05    1156
2005-06    2311
2005-07    6709
2005-08    5686
2006-02     182
Name: rental_id, dtype: int64

In [247]:
df1 = pd.DataFrame(data = sr[:]).rename(columns = {'rental_id' : 'total_count'})
df1

         total_count
month
2005-05         1156
2005-06         2311
2005-07         6709
2005-08         5686
2006-02          182

In [248]:
sql = '''
select left(rental_date, 7) as 'month', count(rental_id) total_count from rental group by month;
'''
pd.read_sql(sql, df).head()

     month  total_count
0  2005-05         1156
1  2005-06         2311
2  2005-07         6709
3  2005-08         5686
4  2006-02          182

In [249]:
# payment table
# 월별 전체 매출, 평균 매출, 결제 횟수
# 위의 갑을 출력하고
# 위의 각각의 값을 dataframe의 칼럼값으로 해서 출력
# pandas, sql

In [250]:
sql = '''
select * from payment;
'''
df_p = pd.read_sql(sql, df)
df_p.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [251]:
df_p = pd.read_sql('select * from payment', df)
df_p.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

In [252]:
df_p['month'] = df_p['payment_date'].apply(lambda x: str(x)[:7])

In [253]:
df_p['month'].head()

0    2005-05
1    2005-05
2    2005-06
3    2005-06
4    2005-06
Name: month, dtype: object

In [254]:
sp = df_p.groupby('month')['payment_id'].count()
sp[:]

month
2005-05    1157
2005-06    2312
2005-07    6711
2005-08    5687
2006-02     182
Name: payment_id, dtype: int64

In [255]:
spa = df_p.groupby('month')['amount'].sum()
spa

month
2005-05     4824.43
2005-06     9631.88
2005-07    28373.89
2005-08    24072.13
2006-02      514.18
Name: amount, dtype: float64

In [256]:
spavg = spa/sp
spavg

month
2005-05    4.169775
2005-06    4.166038
2005-07    4.227968
2005-08    4.232835
2006-02    2.825165
dtype: float64

In [257]:
import numpy as np
df_p.groupby('month').agg({'amount':[np.mean, np.sum], 'payment_id':np.size})

           amount           payment_id
             mean       sum       size
month
2005-05  4.169775   4824.43       1157
2005-06  4.166038   9631.88       2312
2005-07  4.227968  28373.89       6711
2005-08  4.232835  24072.13       5687
2006-02  2.825165    514.18        182

In [258]:
df_pay2 = pd.DataFrame(data = spavg[:]).rename(columns = {0 : 'avg_amount'})
df_pay2

         avg_amount
month
2005-05    4.169775
2005-06    4.166038
2005-07    4.227968
2005-08    4.232835
2006-02    2.825165

In [262]:
dfdf = pd.merge(df_pay, df_pay2, on = 'month').head()
dfdf

         total_amount  avg_amount
month
2005-05       4824.43    4.169775
2005-06       9631.88    4.166038
2005-07      28373.89    4.227968
2005-08      24072.13    4.232835
2006-02        514.18    2.825165

In [263]:
pd.merge(dfdf, df_pay0, on = 'month').head()

         total_amount  avg_amount  count_amount
month
2005-05       4824.43    4.169775          1157
2005-06       9631.88    4.166038          2312
2005-07      28373.89    4.227968          6711
2005-08      24072.13    4.232835          5687
2006-02        514.18    2.825165           182

In [260]:
sql = '''
select left(payment_date, 7) month, count(payment_id) '총구매개수', avg(amount) '월평균매출', sum(amount) '월매출' from payment group by month;
'''
df = pd.read_sql(sql,df)

In [261]:
df

     month  총구매개수     월평균매출       월매출
0  2005-05   1157  4.169775   4824.43
1  2005-06   2312  4.166038   9631.88
2  2005-07   6711  4.227968  28373.89
3  2005-08   5687  4.232835  24072.13
4  2006-02    182  2.825165    514.18